Script started on Wed 07 May 2014 02:44:25 PM PDT
You are currently using 5% (22.5 MiB) of your 488.3 MiB quota.
]0;rbrounle@unix1:lab5[rbrounle@unix1 lab5]$ gdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.6-34.el6)
Copyright (C) 2013 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/s/rbrounle/private/cmps012m/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005bf: file list2.c, line 15.
(gdb) run r[Kfoo bar
Starting program: /afs/cats.ucsc.edu/users/s/rbrounle/private/cmps012m/lab5/list2 foo bar
warning: Skipping deprecated .gdb_index section in /usr/lib/debug/lib64/ld-2.12.so.debug.
Do "set use-deprecated-index-sections on" before the file is read
to use the section anyway.

Breakpoint 1, main (argc=3, argv=0x7fffffffdc88) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print argc
$1 = 3
(gdb) print srb[Kg[K[K[Karb[Kgv
$2 = (char **) 0x7fffffffdc88
(gdb) print argv[0]
$3 = 0x7fffffffdf5c "/afs/cats.ucsc.edu/users/s/rbrounle/private/cmps012m/lab5/list2"
(gdb) print argv[1]
$4 = 0x7fffffffdf9c "foo"
(gdb) print argv[2]
$5 = 0x7fffffffdfa0 "bar"
(gdb) print argv[3]
$6 = 0x0
(gdb) print argv[4]
$7 = 0x7fffffffdfa4 "LANG=en_US.UTF-8"
(gdb) print argv[5]
$8 = 0x7fffffffdfb5 "USER=rbrounle"
(gdb) print argg[Kv[6]
$9 = 0x7fffffffdfc3 "LOGNAME=rbrounle"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 6614] will be killed.

Quit anyway? (y or n) y
]0;rbrounle@unix1:lab5[rbrounle@unix1 lab5]$ exit
exit

Script done on Wed 07 May 2014 02:47:18 PM PDT
